[
  {
    "id": "e1",
    "slug": "past-event-1",
    "speakers": "Rahul Gandhi",
    "title": "Rahul Gandhi Speaks Out in London",
    "subtitle": "The Opposition leader, who is on a tour of the UK, had an interaction session at the ‘Ideas for India’ conference organised by non-profit think-tank Bridge India on 20 May",
    "excerpt": "Rahul Gandhi slams BJP at London conference, says it shouts and stifles voices",
    "start": "2022-05-21T15:52:19+07:30",
    "timezone": "Europe/London",
    "venue": {
      "name": "Press Trust of India",
      "address": "London"
    },

  "body": "Democracy in India is a global public good and a central anchor for the planet and if that cracks, it is going to cause a problem for the planet, Congress leader Rahul Gandhi has warned as he attacked the NDA government, asserting that there are two different designs of governance at play in India, one that stifles voices and the other that listens.\n\n The Opposition leader, who is on a tour of the UK, had an interaction session at the ‘Ideas for India’ conference organised by non-profit think-tank Bridge India on Friday during which he articulated his party’s vision for mass action that would result in something beautiful for the country.\n\nHe attacked the deep state that is causing damage and declared that the Congress ideology is geared up to fight it.\n\nPlease realise, what the BJP does is shout and stifle voices. What we do is listen. They are two different things, they are two different designs, said Gandhi.\n\nJoined at the conference by Opposition leaders, including CPI(M)’s Sitaram Yechury, RJD’s Tejashwi Yadav and TMC’s Mahua Moitra, the Congress leader warned of kerosene all over the country and all it needs is one spark.\n\nA cadre is told, you will say this and nothing else. It’s designed to push a particular set of ideas down people’s throats, whether it is the Communist idea or in the RSS system. We are not designed like that. We are designed to listen to the people of India and pull out their voice and place it on the table, he said.\n\nDemocracy in India is a global public good. It is a central anchor for the planet. Because we are the only people who have managed democracy at the scale that we have. If that cracks, it is going to cause a problem for the planet, he said.\n\nWe believe India is a negotiation between its people; The BJP & the RSS believe India is a geography; that it is a ‘sone ki chidiya’ whose benefits should be distributed to a few. We believe everyone should have equal access, the Congress Party quoted Gandhi as saying.\n\nAsked about the Russia-Ukraine conflict, Gandhi drew parallels with the Chinese actions in India. Russians say to Ukraine that we refuse to recognise your territorial integrity. We refuse to accept that these two districts belong to Ukraine. And we are going to attack you in these two districts to make sure that you break an alliance with NATO, Gandhi said.\n\nThat is what Russian President Vladimir Putin is doing, he said.\n\nPutin is saying I am not ready for you to have an alliance with America. So on the question of your territorial integrity, I will attack you, he said.\n\nPlease recognise the parallels between what is going on in Ukraine and what is going on in Ladakh and in Doklam, the Congress leader said.\n\nPlease realise that the same idea is at play. There are Chinese forces sitting in Ladakh and there are Chinese forces sitting in Doklam, Gandhi said.\n\nThe Doklam forces are designed for Arunachal Pradesh and Ladakh forces are designed for Ladakh. And the same principle is there. What the Chinese are saying is that we do not accept your territoriality and we do accept your relationship with the US.\n\nSo we have to realise that there is a problem on the border and whether we like it or not, we have to prepare for that problem. Because we don’t want to get caught off guard, he said.\n\nHe said that his problem with the government is that they do not allow a discussion.\n\nChinese troops are sitting inside India today. They have just built a huge bridge over the Pangong Lake. They are setting up the infrastructure. They are obviously preparing for something. But the government doesn’t want to talk about it. Government wants to stifle the conversation. That’s bad for India.\n\nThey keep saying that I raise the China issue. Yes, I raise the China issue because I am worried about it. I am worried that Chinese troops are sitting inside India and I can see exactly what is happening in Ukraine. I said this to the Foreign Minister in one of our conversations and he said you know what you have a point. That’s an interesting way to look at it. Please realise that there are parallels to what is going on, Gandhi said.\n\nThe bridge is being built amid the lingering standoff between Indian and Chinese armies at several friction points in eastern Ladakh for over two years.\n\nPeople familiar with the Chinese construction on Wednesday had said that the new bridge is being built in an area that is over 20 km from the Line of Actual Control (LAC).\n\nIndia on Friday voiced strong opposition to China building a second bridge across Pangong lake in eastern Ladakh, and said it is in an area that has been under “illegal occupation” of that country for around 60 years.\n\nExternal Affairs Ministry spokesperson Arindam Bagchi said India has never accepted such illegal occupation of its territory, nor has it accepted the “unjustified” Chinese claim or such construction activities.\n\nWe have made it clear on several occasions that the union territories of Jammu and Kashmir and Ladakh are an integral part of India and we expect other countries to respect India’s sovereignty and territorial integrity, he said.\n\nBagchi said the government has stepped up the development of border infrastructure, especially since 2014, including the construction of roads and bridges in order to ensure that the nation’s security interests are fully protected.\n\nThe government remains committed to the objective of creating infrastructure along the border areas to not only meet India’s strategic and security requirements but also facilitate the economic development of these areas, he added.\n\nDuring the conference here, Gandhi, with reference to his own party, noted: We have an opportunity now that we haven’t had for many years to completely redesign the Congress through mass action. And so do a lot of the Opposition.\n\nGandhi declared he believed that the time for mass action was not in the past few years but is timely now because there is a government in charge that is destroying and attacking the institutional framework of the country.\n\nSo, roles change and you adapt. I see myself as somebody who defends that idea of India when I see our country’s voice being crushed, it upsets me. I think about what I should do and can do. It’s a challenging situation but I think there’s a huge opportunity inside this thing and I feel it.\n\nI feel that from the struggle that is coming, we will get an India that is actually much better than the one we have right now and one we had before. I think there’s something beautiful that can come out of this. I fundamentally believe in the spirit of our country, he said.\n\nEarlier, he took to Twitter to describe the enriching exchange he had during the conference.\n\nWhile in the UK, Gandhi is also set to interact with students at Corpus Christi College, University of Cambridge, on Monday at an event entitled India at 75.",

  "tags": [
      "Dialogue","Rahul Gandhi"
    ],
    "cover": "/images/past-event-1.jpg"
  }
]
