[
  {
    "id": "p1",
    "slug": "sample-post-1",
    "title": "THE INDIAN CONSTITUTION IS MODERN INDIA’S BHAGAVAD GITA",
    "excerpt": "A short excerpt of the policy brief highlighting key recommendations.",
    "content": "The Indian freedom movement was a monumental event in the history of mankind. It was not merely a struggle for independence; it was a visionary campaign for a modern state after emancipation.\n\nThe saga of liberation is essentially a story of the Indian National Congress. Its stalwarts – the likes of Mohandas Gandhi, Jawaharlal Nehru, Subhas Bose and Abul Kalam Azad – not only campaigned for the termination of British rule in India; but looked ahead to the principles the country would adopt after purna swaraj or complete independence. \n[endOfLine]\n\nWhile 15 August 1947 is recognised as India’s Independence Day – and effective self-governance certainly commenced on this date – technically, purna swaraj was accomplished when the Indian Constitution came into effect on 26 January 1950, in effect the institution of India as a republic. It marked the jettisoning of a governor-general representing the United Kingdom’s monarch. \n[endOfLine]\n\nThe central assembly elected at the beginning 1946 gave way to a constituent assembly at the end of the same year. This body undertook the onerous duty of debating and generating by democratic vote the Constitution of India. It borrowed concepts from the constitutions of France and the United States and blended these into a Westminster style of government mindful of India’s complex conditions and requirements. \n[endOfLine]\n\nThere was no dearth of intellectuals in India at the dawn of freedom. Nehru imbibed in his impressionable years the best of Britain, including political thinking of the Fabian Society, which possessed in its ranks George Bernard Shaw, Graham Walls, Sidney Webb, Sydney Olivier and Annie Besant. \n[endOfLine]\n\nThe idea of India administered by Indians was considerably Nehru’s; yet he entrusted the prestigious, if daunting task of drafting the Indian Constitution to a specialist – Bhimrao Ambedkar – despite the latter’s run-ins with the Congress since the 1930s. \n[endOfLine]\n\nStudying at the London School of Economics and Columbia University in New York, Ambedkar received doctorates from both. He also trained as a barrister at Gray’s Inn in London. Ambedkar piloted and obtained passage of what is widely respected as a most enlightened document. Credit also goes to Sir Benegal Rau, a Cambridge-educated member of the Indian Civil Service, who as Constitutional Adviser to the Constituent Assembly produced the first draft for consideration by the drafting committee. \n[endOfLine]\n\nThe Constitution of India is the Bhagavad Gita of the Republic of India. In the past decade, a section of Indians have tragically made every effort to violate the letter and spirit of the sacred script. These people are far removed from the lineage of the sacrifice and achievement of India’s freedom fighters. \n[endOfLine]\n\nIndeed, India is in grave peril from such destructive elements; from colonisation by communalism – which strikes a dagger into the heart of the Constitution. \n[endOfLine]\n\nWE, THE PEOPLE OF INDIA, who have solemnly resolved to secure or promote for all our citizens JUSTICE, LIBERTY, EQUALITY and FRATERNITY, must, therefore, fight tooth and nail to preserve and protect every pledge in our Constitution. \n[endOfLine]",
    "coverImage": "/images/geeta.jpg",
    "category": "Trade",
    "tags": [
      "UK‥India",
      "Policy",
      "Analysis",
      "Constitution"
    ],
    "authorId": "a1",
    "publishedAt": "2025-02-10T09:00:00Z"
  }
]
