[
  {
    "id": "p1",
    "slug": "sample-post-1",
    "title": "THE INDIAN CONSTITUTION IS MODERN INDIA’S BHAGAVAD GITA",
    "excerpt": "A short excerpt of the policy brief highlighting key recommendations.",
    "content": "The Indian freedom movement was a monumental event in the history of mankind. It was not merely a struggle for independence; it was a visionary campaign for a modern state after emancipation.\n\nThe saga of liberation is essentially a story of the Indian National Congress. Its stalwarts – the likes of Mohandas Gandhi, Jawaharlal Nehru, Subhas Bose and Abul Kalam Azad – not only campaigned for the termination of British rule in India; but looked ahead to the principles the country would adopt after purna swaraj or complete independence. \n\n\nWhile 15 August 1947 is recognised as India’s Independence Day – and effective self-governance certainly commenced on this date – technically, purna swaraj was accomplished when the Indian Constitution came into effect on 26 January 1950, in effect the institution of India as a republic. It marked the jettisoning of a governor-general representing the United Kingdom’s monarch. \n\n\nThe central assembly elected at the beginning 1946 gave way to a constituent assembly at the end of the same year. This body undertook the onerous duty of debating and generating by democratic vote the Constitution of India. It borrowed concepts from the constitutions of France and the United States and blended these into a Westminster style of government mindful of India’s complex conditions and requirements. \n\n\nThere was no dearth of intellectuals in India at the dawn of freedom. Nehru imbibed in his impressionable years the best of Britain, including political thinking of the Fabian Society, which possessed in its ranks George Bernard Shaw, Graham Walls, Sidney Webb, Sydney Olivier and Annie Besant. \n\n\nThe idea of India administered by Indians was considerably Nehru’s; yet he entrusted the prestigious, if daunting task of drafting the Indian Constitution to a specialist – Bhimrao Ambedkar – despite the latter’s run-ins with the Congress since the 1930s. \n\n\nStudying at the London School of Economics and Columbia University in New York, Ambedkar received doctorates from both. He also trained as a barrister at Gray’s Inn in London. Ambedkar piloted and obtained passage of what is widely respected as a most enlightened document. Credit also goes to Sir Benegal Rau, a Cambridge-educated member of the Indian Civil Service, who as Constitutional Adviser to the Constituent Assembly produced the first draft for consideration by the drafting committee. \n\n\nThe Constitution of India is the Bhagavad Gita of the Republic of India. In the past decade, a section of Indians have tragically made every effort to violate the letter and spirit of the sacred script. These people are far removed from the lineage of the sacrifice and achievement of India’s freedom fighters. \n\n\nIndeed, India is in grave peril from such destructive elements; from colonisation by communalism – which strikes a dagger into the heart of the Constitution. \n\n\nWE, THE PEOPLE OF INDIA, who have solemnly resolved to secure or promote for all our citizens JUSTICE, LIBERTY, EQUALITY and FRATERNITY, must, therefore, fight tooth and nail to preserve and protect every pledge in our Constitution. \n",
    "coverImage": "/images/geeta.jpg",
    "category": "Trade",
    "tags": [
      "Policy",
      "Analysis",
      "Constitution"
    ],
    "authorId": "a1",
    "publishedAt": "2025-02-10T09:00:00Z"
  },
  {
    "id": "p2",
    "slug": "sample-post-2",
    "title": "RECALIBRATING THE INDIA–LABOUR PARTNERSHIP: A LEGACY FOR CONTEMPORARY RELEVANCE",
    "excerpt": "A historic bond rooted in shared ideals, India and Britain today thrive on strong economic, cultural, and strategic ties, reinforced by the landmark 2025 Free Trade Agreement.",
    "content": "In an era marked by unprecedented global flux, where established paradigms of power shift and historical certainties erode under the weight of new compulsions, there emerges a pressing need to anchor international relationships in shared ideals and enduring solidarities. Among such  relationships, the historical bond between India and the progressive Britons holds a particularly poignant significance. It is a relationship rooted not in convenience, but in conscience.\n\nThis connection was born not of opportunism, but of conviction. From the early decades of the twentieth century, as India’s aspirations for self-rule began to take form, they found an audience within the British Labour movement that was not only receptive but also morally engaged. At a time when imperial orthodoxy dominated the political class in Britain, Labour Party leaders such as Ramsay MacDonald, Clement Attlee, and Harold Laski articulated a principled solidarity that placed India’s freedom struggle within the broader quest for a just world order.\n\nThe intellectual affinity was further strengthened by the influence of the Fabian Society. Its ideals left a deep impression on a generation of Indian leaders, most notably India’s first Prime Minister Jawaharlal Nehru. The architecture of independent India’s political economy, committed t democratic socialism, secularism, planned and inclusive governance, carried clear traces of this imprint.\n\nYet it was not only ideas that sustained this relationship. Acts of political and institutional suppor played a crucial role. In 1918, Congress Party leader Bal Gangadhar Tilak extended a significan financial contribution to the Labour Party. The subsequent success of Labour in the 1922 general elections owed in part to this support.\n\nSimilarly, organisations like the India League, established in London under Congress leader (and later India’s Defence Minister) V.K. Krishna Menon's leadership became important conduits of political exchange. The involvement of influential British thinkers like Bertrand Russell, Michael Foot, Stafford Cripps, and Laski further underlined the strength of this association. These engagements contributed meaningfully to the shaping of Britain’s post-war policy on India, culminating in the landmark decision of the Attlee government to grant India independence in 1947.\n\nIn contemporary times, the partnership has found new expression through a robust and multifaceted engagement. India, no longer a passive recipient of British policy, is today a significant economic and strategic actor. Gone are the days when UK-India trade ties were limited to British exports after Indian manufacturing capacity was decimated under colonialism; India now runs a trade surplus with the UK. It stands as the second-largest foreign investor in\nthe United Kingdom, and Indian businesses contribute over £48 billion to the British economy\nwhile generating employment for tens of thousands.\n\n This economic synergy was powerfully reinforced with the signing of the Free Trade Agreement (FTA) in July 2025. The FTA is projected to double bilateral trade to $120 billion by 2030 by eliminating tariffs on 99% of Indian exports to the UK, boosting textiles, leather, and marine trade. In return, India will reduce tariffs on key UK exports like automobiles and whisky. This agreement is a testament to the evolving partnership, promising to unlock new avenues for economic growth and deepen the interdependence of both nations. This level of engagement reflects a shared commitment to mutual prosperity and a recognition of India’s growing role on the global stage.\n\nPerhaps even more significant is the human dimension of the relationship. The British-Indian community, now numbering over two million, represents the largest visible ethnic minority in the United Kingdom. Its contributions to British society are both deep and diverse. Whether in the arts, business, public service, or academia, individuals of Indian origin have become integral to the British national fabric. The cultural impact of personalities such as Freddie Mercury, Salman Rushdie, F. N. Souza, and Sir Anish Kapoor stand alongside the public service and sacrifice of figures like Noor Inayat Khan, whose heroism during the Second World War remains a powerful reminder of shared values and intertwined histories. Similarly, leaders like Lord Swraj Paul, Lord Karan Bilimoria, and Virendra Sharma exemplify the community's role in shaping policy and governance in Britain today.\n\nIt is true that no relationship of such depth can remain free of disagreement. There have been instances where parties have taken disquieting positions on Kashmir, which is an integral part of India (on which there is bipartisan consensus in India). Similarly, there have been tensions in Leicester which reportedly were engineered. Likewise, the platforming of dissident forces that question India’s territorial integrity inevitably causes alarm in India. However, the UK government has time and again demonstrated a willingness to engage in dialogue and course correction. By seeking a more balanced and informed approach, Britain has acknowledged that enduring relationships require dialogue, mutual respect, and a commitment to historical responsibility. Looking ahead, the world faces a range of converging crises, from climate change to democratic backsliding, that cannot be addressed in isolation. Both India and Britain share history, arecommitted to a liberal world order and are genuine partners. Given this, it is critical that\nprogressive forces (academics, activists, policymakers, professionals) from both nations work closely together to forge a multipolar, equitable and just world order.",
    "coverImage": "/images/p2.jpg",
    "category": "Trade",
    "tags": [
      "Policy",
      "Partnership"
    ],
    "authorId": "a2",
    "publishedAt": "2025-08-20T09:00:00Z"
  },
  {
    "id": "p3",
    "slug": "sample-post-4",
    "title": "AMBEDKAR IN THE UK: A LIVING LEGACY",
    "excerpt": "Dr. B.R. Ambedkar’s legacy lives on in the UK through museums, activism, and student movements that continue his fight for equality, dignity, and justice.",
    "content": "What does it mean for one person’s ideas to inspire movements across continents and generations?\nFor millions, the answer lies in the life and work of Babasaheb Dr Bhimrao Ramji Ambedkar (1891–1956).\nA tireless reformer and the chief architect of India’s Constitution, Ambedkar dedicated his life to the fight for equality, dignity, and justice.\n\nIn India, his vision lives on through the Constitution’s promises of liberty, equality, and fraternity.\nBut his influence also reaches far beyond India’s borders.\nHere in the UK, his legacy is kept alive through community initiatives, anti-caste collectives, and charities founded in his name.\nEach year, his birthday is celebrated—even in Parliament.\n\nAmbedkar’s message has long resonated in the struggle against caste discrimination within the South Asian diaspora, and in the spaces created by Ambedkarite activists in Britain to foster belonging in often unwelcoming environments.\nToday, his vision continues to inspire Dalit feminists and students standing up to casteism on UK campuses.\n\nThis article introduces you to the Ambedkar Museum London, the Ambedkar Room at Gray’s Inn, and the grassroots movements that keep his fight for equality alive in Britain.\n\n**Ambedkar Museum London**\n\nSeptember 2025 marked ten years since the Government of Maharashtra acquired 10 King Henry’s Road, NW3 2RP—the London home where Dr B.R. Ambedkar lodged in the 1920s.\nThe purchase followed a proposal by the Federation of Ambedkarite and Buddhist Organisations UK (FABO UK).\n\nToday, the Ambedkar Museum near Primrose Hill is the only memorial outside India at a site where Ambedkar actually lived.\nIt has become a place of pilgrimage for Ambedkarites, scholars, campaigners—and a stage for visiting Indian politicians whose photo-ops often circulate back home.\n\nBut memory alone cannot keep a museum alive.\nThe London site needs consistent funding, upkeep, and outreach to reach audiences unfamiliar with Ambedkar’s life and work.\n\n**Gray’s Inn: The Ambedkar Room**\n\nIn 2021, Gray’s Inn unveiled a new portrait of Ambedkar and opened the Ambedkar Room—the only space in the Inn dedicated to an Indian alumnus.\nThe portrait, painted by David Newens and donated by FABO UK, sits alongside earlier tributes gifted in 1974 and 2016.\n\nIt is now both a study space for barristers-in-training and a reminder of Ambedkar’s own legal journey in Britain.\n\n**Building the Movement**\n\nAmbedkarite activism in the UK began long before museums and portraits.\nFrom the 1960s, organisations sprang up to promote his vision.\nThe Indian Buddhist Society London (1964) later renamed the Ambedkar International Mission, was the first.\nOther notable groups included the Republican Group of Great Britain (later renamed Dr Ambedkar Mission Society, Glasgow), the Dr Ambedkar Buddhist Organisation in Birmingham, the Dr Ambedkar Memorial Committee of Great Britain (1969), and the Ambedkar Mission Society Bedford.\n\nThe 1970s saw further expansion with groups such as the Dr Ambedkar Memorial Trust (London) and the Dr Ambedkar Buddhist Association (Southall).\nIn 1982, the Ambedkar Buddhist Council UK was founded to coordinate efforts, later evolving into the FABO UK.\n\nAmbedkarite organisations also donated statues and portraits to institutions including LSE, Gray’s Inn, and Columbia University, while funding schools in India.\n\n**Caste in Britain**\n\nCaste is not just a hierarchy—it is a mind-set and travels.\nIn India, manual scavenging remains deadly decades after being banned.\nCaste still creates barriers to education, dignity and opportunity.\nThat is why the recent announcements on caste censuses in India are so welcome to get a measure of the reality of the impact of caste.\n\nCampaigners in the UK—including the Anti Caste Discrimination Alliance, CasteWatch UK, Dalit Solidarity Network UK—are pressing for action.\nThe Equality Act 2010 includes powers to ban caste discrimination, made a legal duty in 2013.\nYet lobbying by mainly Hindu groups and a flawed government consultation has stalled implementation.\n\nWith more than 5.5 million South Asians in England and Wales (9.3% of the population (2021 Census)) and over 90,000 in Scotland, caste discrimination in workplaces, schools, and services is not a “community issue.”\nTrade unions including the Black Members UNISON, the Bakers’ Union, and the Musicians’ Union are among those backing enforcement.\n\n**Dalit Students in UK Universities**\n\nMany Dalit students I have come across in the last two decades arrived through government scholarships (hard earned, and fought for), Chevening awards, and UKRI research funding for example.\nThe informal student networks have emerged since 2018 into formal student societies in Ambedkar’s name at SOAS, LSE, Oxford, Lancaster, Leeds and Edinburgh for example.\n\nThese societies offer a counter-narrative and spaces of belonging for students who sometimes feel excluded.\nInspired by Ambedkar’s writings, and their own lived experiences, they push universities to recognise caste discrimination in equality frameworks.\nSOAS and LSE student unions now explicitly reject caste discrimination.\n\n**Looking Ahead**\n\nAs 2026 nears—the 90th anniversary of Annihilation of Caste—Ambedkar’s warning rings true: caste is not just social but mental, economic, and physical oppression.\nHis prescription still stands: dismantle it, uplift the oppressed, and build a just society.\n\nThe UK already has the legal tools.\nWhat’s missing is enforcement.\nBeyond law, Ambedkar must be remembered not as a sectional leader but as a thinker of global significance.\n\nIf his legacy in Britain—through museums, portraits, activism, and students—sparks a new generation of bold ideas on justice and fraternity, the emancipatory project Babasaheb Dr Ambedkar began will live on.",
    "coverImage": "/images/ambedkar.jpg",
    "category": "Trade",
    "tags": [
      "Policy",
      "Partnership"
    ],
    "authorId": "a3",
    "publishedAt": "2025-09-15T09:00:00Z"
  }
]
