[
  {
    "id": "m1",
    "name": "Khalid Sofi",
    "role": "Partner, Lee Bolton Monier Williams LLP ",
    "bio": "Khalid Sofi is a solicitor, partner and head of charity & not- for- profit at Lee Bolton Monier-Williams LLP (London based law firm) He is well known and highly regarded for his expertise and advises charity and not-for- profit organisations nationally and internationally. He also advises  governments on developing and improving regulatory framework for charity and not -for- profit sector  He is ranked as a Leading partner for Charites and Not-for-profit by Legal 500.",
    "photo": "/images/trust1.jpg"
  },
  {
    "id": "m2",
    "name": "Ashwin Kumaraswami",
    "role": "Investment Director at Mercia Asset Management ",
    "bio": "Ashwin is an accomplished investor and Investment Director at Mercia Asset Management, where he leads early-stage investments in deep-tech, hard-tech, and emerging technologies. With over 15 years of experience in venture capital, he has held board roles across numerous UK tech companies, including Mindtrace and Mindtech Global. Formerly a semiconductor entrepreneur, Ashwin has a strong track record in commercialising university IP and scaling high-growth startups. He currently serves as a director for several companies, focusing on transformative innovations in AI, biotech, IoT, and software. His strategic guidance has helped shape the UK’s deep-tech venture ecosystem",
    "photo": "/images/trust2.jpg"
  },
  {
    "id": "m3",
    "name": "Supriyo Chaudhuri ",
    "role": "CEO of e1133 Learning Systems ",
    "bio": "Supriyo Chaudhri is a UK-based education entrepreneur and CEO of e1133 Learning Systems, with over 30 years of experience in workforce education across higher and professional sectors. He co-founded UAspire and led strategic education programmes at Knod and ATMC Group, partnering with industry giants like IBM, GE, Oracle, ACCA, and Grant Thornton. He has built and scaled transnational education ventures across Asia, the Middle East, and the UK. Serving as director of multiple UK education and tech ventures, Supriyo is also a Fellow of the Royal Society of Arts (FRSA). ",
    "photo": "/images/trust3.jpg"
  },
  {
    "id": "m4",
    "name": "Pushparaj Deshpande",
    "role": "Managing Trustee, Samruddha Bharat Foundation ",
    "bio": "Pushparaj Deshpande is the Managing Trustee and Director of Samruddha Bharat. He has worked on policy and politics with various legislators, a consulting firm, the Congress Party etc. He is the editor of the Rethinking India series and writes for numerous dailies. He studied at Oxford University, St. Stephen’s College and the Doon School.",
    "photo": "/images/trust4.jpg"
  }
]
